# --- Категории ---
instruments_data = {
    "Струнные": [
        "Гитара", "Бас-гитара", "Скрипка", "Альт", "Виолончель",
        "Контрабас", "Арфа", "Банджо", "Укулеле", "Балалайка",
        "Домра", "Мандолина", "Ситар", "Цитра"
    ],
    "Клавишные": [
        "Фортепиано", "Рояль", "Синтезатор", "Орган", "Аккордеон",
        "Баян", "Клавесин", "Меллотрон"
    ],
    "Ударные": [
        "Барабан", "Малый барабан", "Большой барабан", "Том-том",
        "Тарелки", "Бонго", "Конга", "Кахон", "Ксилофон", "Маримба",
        "Треугольник", "Тамбурин", "Кастаньеты", "Джембе"
    ],
    "Духовые (деревянные)": [
        "Флейта", "Пикколо", "Гобой", "Кларнет", "Фагот", "Дудук",
        "Саксофон", "Блокфлейта"
    ],
    "Духовые (медные)": [
        "Труба", "Тромбон", "Валторна", "Туба", "Корнет", "Флюгельгорн"
    ],
    "Электронные": [
        "Электрогитара", "Электробас", "Терменвокс", "Драм-машина",
        "Сэмплер", "Синтезатор модульный"
    ],
    "Народные инструменты": [
        "Гусли", "Жалейка", "Варган", "Бубен", "Дуда", "Свирель",
        "Калимба", "Шакухачи", "Ситар", "Пандейро"
    ],
    "Струнно-смычковые": [
        "Скрипка", "Альт", "Виолончель", "Контрабас", "Никельхарпа"
    ]
}

genres_data = ["Классическая музыка", "Поп", "Рок", "Хип-хоп", "Электронная музыка", "Народная музыка",
               "Джаз и Блюз", "Экспериментальная музыка"]